7767517
143 159
Input            input                    0 1 input
Convolution      Conv_0                   1 1 input 478 0=24 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=648
ReLU             Relu_1                   1 1 478 258
Split            splitncnn_0              1 2 258 258_splitncnn_0 258_splitncnn_1
ConvolutionDepthWise Conv_2                   1 1 258_splitncnn_1 481 0=24 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=600 7=24
ReLU             Relu_3                   1 1 481 261
Convolution      Conv_4                   1 1 261 484 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
BinaryOp         Add_5                    2 1 484 258_splitncnn_0 264 0=0
ReLU             Relu_6                   1 1 264 265
Split            splitncnn_1              1 2 265 265_splitncnn_0 265_splitncnn_1
ConvolutionDepthWise Conv_7                   1 1 265_splitncnn_1 487 0=24 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=600 7=24
ReLU             Relu_8                   1 1 487 268
Convolution      Conv_9                   1 1 268 490 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
BinaryOp         Add_10                   2 1 490 265_splitncnn_0 271 0=0
ReLU             Relu_11                  1 1 271 272
Split            splitncnn_2              1 2 272 272_splitncnn_0 272_splitncnn_1
ConvolutionDepthWise Conv_12                  1 1 272_splitncnn_1 493 0=24 1=5 11=5 2=1 12=1 3=2 13=2 4=2 14=2 15=2 16=2 5=1 6=600 7=24
ReLU             Relu_13                  1 1 493 275
Convolution      Conv_14                  1 1 275 496 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1152
Pooling          MaxPool_15               1 1 272_splitncnn_0 278 0=0 1=2 11=2 2=2 12=2 3=0 13=0 14=0 15=0 5=1
Convolution      Conv_16                  1 1 278 499 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1152
ReLU             Relu_17                  1 1 499 281
BinaryOp         Add_18                   2 1 496 281 282 0=0
ReLU             Relu_19                  1 1 282 283
Split            splitncnn_3              1 2 283 283_splitncnn_0 283_splitncnn_1
ConvolutionDepthWise Conv_20                  1 1 283_splitncnn_1 502 0=48 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=1200 7=48
ReLU             Relu_21                  1 1 502 286
Convolution      Conv_22                  1 1 286 505 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
BinaryOp         Add_23                   2 1 505 283_splitncnn_0 289 0=0
ReLU             Relu_24                  1 1 289 290
Split            splitncnn_4              1 2 290 290_splitncnn_0 290_splitncnn_1
ConvolutionDepthWise Conv_25                  1 1 290_splitncnn_1 508 0=48 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=1200 7=48
ReLU             Relu_26                  1 1 508 293
Convolution      Conv_27                  1 1 293 511 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
BinaryOp         Add_28                   2 1 511 290_splitncnn_0 296 0=0
ReLU             Relu_29                  1 1 296 297
Split            splitncnn_5              1 2 297 297_splitncnn_0 297_splitncnn_1
ConvolutionDepthWise Conv_30                  1 1 297_splitncnn_1 514 0=48 1=5 11=5 2=1 12=1 3=2 13=2 4=2 14=2 15=2 16=2 5=1 6=1200 7=48
ReLU             Relu_31                  1 1 514 300
Convolution      Conv_32                  1 1 300 517 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1152
ReLU             Relu_33                  1 1 517 303
Convolution      Conv_34                  1 1 303 520 0=24 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=14400
ReLU             Relu_35                  1 1 520 306
Convolution      Conv_36                  1 1 306 523 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_37                  1 1 523 309
Pooling          MaxPool_38               1 1 297_splitncnn_0 310 0=0 1=2 11=2 2=2 12=2 3=0 13=0 14=0 15=0 5=1
Convolution      Conv_39                  1 1 310 526 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4608
ReLU             Relu_40                  1 1 526 313
BinaryOp         Add_41                   2 1 309 313 314 0=0
ReLU             Relu_42                  1 1 314 315
Split            splitncnn_6              1 2 315 315_splitncnn_0 315_splitncnn_1
ConvolutionDepthWise Conv_43                  1 1 315_splitncnn_1 529 0=96 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=2400 7=96
ReLU             Relu_44                  1 1 529 318
Convolution      Conv_45                  1 1 318 532 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_46                  1 1 532 321
Convolution      Conv_47                  1 1 321 535 0=24 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=14400
ReLU             Relu_48                  1 1 535 324
Convolution      Conv_49                  1 1 324 538 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_50                  1 1 538 327
BinaryOp         Add_51                   2 1 327 315_splitncnn_0 328 0=0
ReLU             Relu_52                  1 1 328 329
Split            splitncnn_7              1 2 329 329_splitncnn_0 329_splitncnn_1
ConvolutionDepthWise Conv_53                  1 1 329_splitncnn_1 541 0=96 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=2400 7=96
ReLU             Relu_54                  1 1 541 332
Convolution      Conv_55                  1 1 332 544 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_56                  1 1 544 335
Convolution      Conv_57                  1 1 335 547 0=24 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=14400
ReLU             Relu_58                  1 1 547 338
Convolution      Conv_59                  1 1 338 550 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_60                  1 1 550 341
BinaryOp         Add_61                   2 1 341 329_splitncnn_0 342 0=0
ReLU             Relu_62                  1 1 342 343
Split            splitncnn_8              1 5 343 343_splitncnn_0 343_splitncnn_1 343_splitncnn_2 343_splitncnn_3 343_splitncnn_4
ConvolutionDepthWise Conv_63                  1 1 343_splitncnn_4 553 0=96 1=5 11=5 2=1 12=1 3=2 13=2 4=2 14=2 15=2 16=2 5=1 6=2400 7=96
ReLU             Relu_64                  1 1 553 346
Convolution      Conv_65                  1 1 346 556 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_66                  1 1 556 349
Convolution      Conv_67                  1 1 349 559 0=24 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=14400
ReLU             Relu_68                  1 1 559 352
Convolution      Conv_69                  1 1 352 562 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_70                  1 1 562 355
Pooling          MaxPool_71               1 1 343_splitncnn_3 356 0=0 1=2 11=2 2=2 12=2 3=0 13=0 14=0 15=0 5=1
Convolution      Conv_72                  1 1 356 565 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             Relu_73                  1 1 565 359
BinaryOp         Add_74                   2 1 355 359 360 0=0
ReLU             Relu_75                  1 1 360 361
Split            splitncnn_9              1 2 361 361_splitncnn_0 361_splitncnn_1
ConvolutionDepthWise Conv_76                  1 1 361_splitncnn_1 568 0=96 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=2400 7=96
ReLU             Relu_77                  1 1 568 364
Convolution      Conv_78                  1 1 364 571 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_79                  1 1 571 367
Convolution      Conv_80                  1 1 367 574 0=24 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=14400
ReLU             Relu_81                  1 1 574 370
Convolution      Conv_82                  1 1 370 577 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_83                  1 1 577 373
BinaryOp         Add_84                   2 1 373 361_splitncnn_0 374 0=0
ReLU             Relu_85                  1 1 374 375
Split            splitncnn_10             1 2 375 375_splitncnn_0 375_splitncnn_1
ConvolutionDepthWise Conv_86                  1 1 375_splitncnn_1 580 0=96 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=2400 7=96
ReLU             Relu_87                  1 1 580 378
Convolution      Conv_88                  1 1 378 583 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_89                  1 1 583 381
Convolution      Conv_90                  1 1 381 586 0=24 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=14400
ReLU             Relu_91                  1 1 586 384
Convolution      Conv_92                  1 1 384 589 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_93                  1 1 589 387
BinaryOp         Add_94                   2 1 387 375_splitncnn_0 388 0=0
ReLU             Relu_95                  1 1 388 389
Split            splitncnn_11             1 3 389 389_splitncnn_0 389_splitncnn_1 389_splitncnn_2
ConvolutionDepthWise Conv_96                  1 1 343_splitncnn_2 390 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=864 7=96
ReLU             Relu_97                  1 1 390 391
Convolution      Conv_98                  1 1 391 392 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=768
Permute          Transpose_99             1 1 392 393 0=3
ConvolutionDepthWise Conv_100                 1 1 343_splitncnn_1 394 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=864 7=96
ReLU             Relu_101                 1 1 394 395
Convolution      Conv_102                 1 1 395 396 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=384
Permute          Transpose_103            1 1 396 397 0=3
ConvolutionDepthWise Conv_104                 1 1 343_splitncnn_0 398 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=864 7=96
ReLU             Relu_105                 1 1 398 399
Convolution      Conv_106                 1 1 399 400 0=20 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1920
Permute          Transpose_107            1 1 400 401 0=3
ConvolutionDepthWise Conv_108                 1 1 389_splitncnn_2 402 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=864 7=96
ReLU             Relu_109                 1 1 402 403
Convolution      Conv_110                 1 1 403 404 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
Permute          Transpose_111            1 1 404 405 0=3
ConvolutionDepthWise Conv_112                 1 1 389_splitncnn_1 406 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=864 7=96
ReLU             Relu_113                 1 1 406 407
Convolution      Conv_114                 1 1 407 408 0=12 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1152
Permute          Transpose_115            1 1 408 409 0=3
ConvolutionDepthWise Conv_116                 1 1 389_splitncnn_0 410 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=864 7=96
ReLU             Relu_117                 1 1 410 411
Convolution      Conv_118                 1 1 411 412 0=60 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=5760
Permute          Transpose_119            1 1 412 413 0=3
Reshape          Reshape_125              1 1 393 423 0=4 1=-1
Reshape          Reshape_131              1 1 405 433 0=4 1=-1
Concat           Concat_132               2 1 423 433 boxes 0=0
Reshape          Reshape_138              1 1 397 444 0=2 1=-1
Reshape          Reshape_144              1 1 409 454 0=2 1=-1
Concat           Concat_145               2 1 444 454 455 0=0
Reshape          Reshape_151              1 1 401 465 0=10 1=-1
Reshape          Reshape_157              1 1 413 475 0=10 1=-1
Concat           Concat_158               2 1 465 475 landmark 0=0
Softmax          Softmax_159              1 1 455 scores 0=1 1=1
